
#ifndef _H_CONST_H_
#define _H_CONST_H_
#include "cocos2d.h"
#define TIMESCALE 5.0f//时间比例尺
#define ACTION_BAR_TIME 4.0f//建筑物中进度条秒数
#define HERO_MOVE_SPEED 0.6f//地图中移动速度，min/px

#if (CC_TARGET_PLATFORM == CC_PLATFORM_IOS)
#define ANALYTICS
#endif

static std::string acname[] = { "打猎", "采集", "砍伐", "挖掘" };
static std::string acdesc[] = {"","你徒手采集", "你徒手劈树", "你徒手采矿"};
static std::string acdesc2[] = { "", "费了好大力才获得了", "手掌都快劈烂了才获得了", "双手都磨破了才扣下来" };
static std::string acdesc1[] = {"", "你使用镰刀收割，毫不费力的获得", "你使用斧子劈树，毫不费力的获得", "你挥舞十字镐采矿，毫不费力的获得" };

static std::string herofightdesc[] = { "%s猛地跑上前去，对着%s耍了一通野球拳。"};
static std::string herofightdesc1[][5] = { {"%s挥舞着%s犹如黑虎下山，以迅猛之势击中%s，连连后退数步方稳住身形。", "%s把一根%s舞的密不透风，趁%s分神之际，直捣面门。", "%s高举手中的%s，三两步便靠近%s，一招将其打翻在地。", "%s手持%s将%s逼到角落，大喝一声“受死吧！”", "%s双手紧握%s虚晃一棍，接着“黑龙出洞”攻击%s胸口。"}, 
{"%s猛的挥出%s，气势凛冽，声如破竹，直奔%s面门而来。", "%s手握%s，冷冷了望着面前的%s，身形向前猛的一动，犹如毒蛇吐着芯子一般冲了过来。", "%s手持%s，刀刀抢攻，狠辣迅捷直逼%s要害。", "%s手握%s，招数精奇，攻击%s咽喉要害。", "%s手中%s犹如一条出海蛟龙，刀风凛冽，刚猛强劲。"}, 
{"%s手中的%s轻轻一挑，拨开%s的武器，并反手一打，正中对方胸口。", "%s手中的%s化作一道耀眼眼光，直中%s。", "%s手握%s剑长3尺，剑气逼人，让人眼花缭乱。", "%s从背后拿出%s深吸一口气后，暗中使上内力，朝着%s大力投射过去。", "只见%s青光闪动，一柄%s地刺出，腕抖剑斜，剑锋削向对方右颈。"} };

static std::string herofightdesc2[][5] = { { "%s被震的向后退了几步，差点倒在地上，受到了%d点伤害。", "%s哇哇吐出一堆鲜血。受到了%d点伤害。", "%s似乎受到了重击，已经摇摇欲坠，受到了%d点伤害。", "%s单膝跪地，粗气连连，似乎耗费了很多力气，受到了%d点伤害。", "%s以剑挡格，铮的一声响，武器相击，嗡嗡作声，长剑猛地击落" }, 
{"%s胸口中了一刀，鲜血砰的一声喷出来。受到了%d点伤害。", "%s连忙收住身形，向左一滚，脸角擦破。受到了%d点伤害。", "%s大叫一声不好，左腿已经中了一刀。受到了%d点伤害。", "%s挥着兵器想去挡住这一刀，可惜为时已晚，刀口已经从他胸口划过。受到了%d点伤害。", "%s面色剧变，一时定在原地，胸口一闷。受到了%d点伤害。" },
{"%s喷出一口鲜血，单膝跪在地上，身体已经有些摇晃不稳。受到了%d点伤害。", "%s暗道不妙，未等来得及反应，已被胸口已被刺中。受到了%d点伤害。", "%s翻滚勉强躲过一剑，却被反手一剑刺中，正中后腰上，翻倒在地。受到了%d点伤害。", "%s已经连续挡住十余剑，此时已经大汗淋漓，手臂多处剑痕。受到了%d点伤害。"} };

static std::string herofightdesc3[] = { "拳头打在%s身上如同挠痒痒一样。受到了%d点伤害。" };

static std::string bossfight[] = {"%s雷鸣闪电样迅速击中%s，硬生生的接住这一掌，受到%d点伤害。"};
static std::string bossfight1[] = { "%s雷鸣闪电样迅速击中%s，幸亏有%s挡了一下，虽然没有大碍，但还是受到%d点伤害。" };

static std::string herofightworfword[] = { "%s面对眼前的%s，凝神运气，迅速踢出一脚。 " };
static std::string herofightworfword2[] = { "%s被突如其来的一脚踢中脊梁，向后滚了好几圈。受到%d点伤害 " };
static std::string worffight[] = { "%s翻起身朝%s冲了过来，一口咬在了腿上。受到%d点伤害。" };

static std::string herofightRabbitword[] = { "%s趁%s吃草的时候，一个马步上前，狠狠一脚踢到它的脑袋上。" };
static std::string herofightRabbitword2[] = { "%s四脚朝天，飞了出去。受到%d伤害" };
static std::string rabbitfightword[] = { "%s蹦蹦跳跳的跑过来在%s脚上咬了一口。受到%d伤害" };


static std::string heroname[] = { "小虾米", "三少爷", "江小白", "阿青" };
static std::string herodesc[] = { "名门之后，因家族武功被邪教窥觑，惨遭灭门，只剩孤身一人", "从未来穿越而来的特种兵，为了回到属于自己的时代而被迫行走江湖", "恶人谷出身，习得各大恶人的看家本领，但本性善良，被送出谷历练", "情郎被邪教蛊惑，为寻回情郎，孤身一人闯荡江湖！" };
static int heroprice[] = { 0, 6, 12, 30 };

static int buyprice[] = { 0, 6, 12, 30, 6, 6, 6, 6, 6, 6, 12, 12, 30};

static std::string payCode[] = { "", "wx010", "wx011", "wx013", "wx001", "wx002", "wx003", "wx004", "wx005", "wx006", "wx007", "wx008", "wx009"};

static std::string tipswords[] = { "精神的愉悦可以让你的做任何事情都事半功倍", "重复性的工作只会让你的精神越来越抑郁", "饥饿会让你的战斗力直线下降，所以战斗前一定要吃饱饭！", "每个武林中人都有属于自己的独门武功，去打败他们获得武功吧！",
"自身的强大才是真正的强大，武器只是让你强上加强的一种工具", "受伤严重时使用对应的药物即可恢复", "受伤严重时会影响你的武力发挥，并让你的生命状态降低", "闭关打坐的时间越长获得的经验值越高",
"后山上有可供你活下去的各种资源，合理的利用可以让你的生活更好", "后山的狼和兔子是个练基本功的好对手" };
#endif // _H_CONST_H_
